this change is applied

```console
$ aws-vault exec hyperbola-prod-admin -- terraform plan
Opening the SSO authorization page in your default browser (use Ctrl-C to abort)
https://device.sso.us-west-2.amazonaws.com/?user_code=HRHW-QXHR
aws_s3_bucket.state_access_logs: Refreshing state... [id=hyperbola-static-terraform-state-logs]
aws_dynamodb_table.terraform_statelock: Refreshing state... [id=terraform_statelock]
aws_s3_bucket_public_access_block.state_access_logs: Refreshing state... [id=hyperbola-static-terraform-state-logs]
aws_s3_bucket.this: Refreshing state... [id=hyperbola-static-terraform-state]
aws_s3_bucket_public_access_block.this: Refreshing state... [id=hyperbola-static-terraform-state]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # aws_dynamodb_table.terraform_statelock has changed
  ~ resource "aws_dynamodb_table" "terraform_statelock" {
        id             = "terraform_statelock"
        name           = "terraform_statelock"
        tags           = {}
        # (7 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the
following plan may include actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.terraform_statelock will be updated in-place
  ~ resource "aws_dynamodb_table" "terraform_statelock" {
        id             = "terraform_statelock"
        name           = "terraform_statelock"
        tags           = {}
        # (7 unchanged attributes hidden)



      ~ server_side_encryption {
          ~ kms_key_arn = "arn:aws:kms:us-west-2:473124112471:key/d20dded2-a4ef-4372-8730-096bdeba2366" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_kms_key.terraform_statelock will be created
  + resource "aws_kms_key" "terraform_statelock" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "managed_by" = "terraform"
          + "project"    = "remote-state"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run
"terraform apply" now.
[12:50] [project-infrastructure/remote-state] on  lopopolo/dynamodb-encryption-customer-managed-key [⇡] via 💠 default took 59s
$ aws-vault exec hyperbola-prod-admin -- terraform apply
aws_s3_bucket.state_access_logs: Refreshing state... [id=hyperbola-static-terraform-state-logs]
aws_dynamodb_table.terraform_statelock: Refreshing state... [id=terraform_statelock]
aws_s3_bucket_public_access_block.state_access_logs: Refreshing state... [id=hyperbola-static-terraform-state-logs]
aws_s3_bucket.this: Refreshing state... [id=hyperbola-static-terraform-state]
aws_s3_bucket_public_access_block.this: Refreshing state... [id=hyperbola-static-terraform-state]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # aws_dynamodb_table.terraform_statelock has changed
  ~ resource "aws_dynamodb_table" "terraform_statelock" {
        id             = "terraform_statelock"
        name           = "terraform_statelock"
        tags           = {}
        # (7 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the
following plan may include actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.terraform_statelock will be updated in-place
  ~ resource "aws_dynamodb_table" "terraform_statelock" {
        id             = "terraform_statelock"
        name           = "terraform_statelock"
        tags           = {}
        # (7 unchanged attributes hidden)



      ~ server_side_encryption {
          ~ kms_key_arn = "arn:aws:kms:us-west-2:473124112471:key/d20dded2-a4ef-4372-8730-096bdeba2366" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_kms_key.terraform_statelock will be created
  + resource "aws_kms_key" "terraform_statelock" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "managed_by" = "terraform"
          + "project"    = "remote-state"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_kms_key.terraform_statelock: Creating...
aws_kms_key.terraform_statelock: Still creating... [10s elapsed]
aws_kms_key.terraform_statelock: Creation complete after 11s [id=12565218-76fc-42e9-94aa-be0765ec6e7c]
aws_dynamodb_table.terraform_statelock: Modifying... [id=terraform_statelock]
aws_dynamodb_table.terraform_statelock: Still modifying... [id=terraform_statelock, 10s elapsed]
aws_dynamodb_table.terraform_statelock: Still modifying... [id=terraform_statelock, 20s elapsed]
aws_dynamodb_table.terraform_statelock: Still modifying... [id=terraform_statelock, 30s elapsed]
aws_dynamodb_table.terraform_statelock: Still modifying... [id=terraform_statelock, 40s elapsed]
aws_dynamodb_table.terraform_statelock: Modifications complete after 45s [id=terraform_statelock]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.

```